[
    "Fridge was perspiring bad and we noticed that the top seal is faulty letting in humidity.\r\nWe got a good deal on it so I guess I can’t complain too mich",
    "I bought this refrigerator as a 2nd for my downstairs rec room.  I went for the ice maker option.  It is great for my use, trouble free and looks nice.",
    "I looked at a ton of narrow/counter depth models. However, a lot of them don’t have the same capacity, are cheaply made, or didn’t have the features I was looking for. Although there are some models that are less expensive, they have to be defrosted or had really bad reviews. I kept coming back to this model. It is gorgeous inside and out. Not only is it beautiful, but it’s SO functional. I love that there are two drawers in the fridge part. You can use one for produce and one for beverages, meats, or deli. Because I regularly keep sparkling wine on hand, the bottle holders are awesome. But if you need more room, are don’t need them, flip them up for yet even more room! The fold away top shelf is awesome too! I’m hosting brunch and needed room for large bottles for juice, milk, etc. Folded the shelf away to get more tall space. And don’t even get me started on the double freezer drawers! OMG! Love them! So roomy and you can use the top one for items you want to get to on the daily (ice, ice cream, smoothie stuff and  other goodies), and use the lower larger freezer for bigger items that you only need to get to for that weekly dinner.",
    "Very roomy and practical! Great design of the inside to maximize the space. Sleek and modern looking that fits in well with the rest of my furniture.",
    "Fit the bill. Had up to date features,smaller size without looking like a midget fridge. A one or two person household needs less is more thinking.",
    "Wonderful fridge with all features needed and fits in a small space.Just enough for 2 people in a small apartment. Looks terrific, modern and sleek",
    "Modern aesthetics, well thought-out design, quiet, efficient operation, which is important for our off-grid home.  Well executed product, GE!",
    "Perfect size. Looks great and is very quiet. I really wanted a quiet running, small refrigerator for my smaller kitchen and this is great.",
    "A first time buy...trying to use room as we down size---Bought unit mid-septemberof 1018---so enjoy the unit and all its features",
    "Great sliding freezer drawers and you can see the temp from the outside of refrigerator door and  lines up even with counter top.",
    "We bought this when we downsized. It fits perfect in our small kitchen and it has ample room for us.  The freezer is perfect.   We have gotten so many positive comments on this frig.",
    "Quiet, great design and the perfect size for a guest cottage fridge and freezer. The optional ice maker works well, but does take up most of the space in the first freezer drawer.",
    "Love the narrower width which gave me some more counter space in my somewhat small kitchen.  I found it to be enough room to put everything I need in it and it looks very stylish.",
    "We have a small condo kitchen and it’s just the two of us. This fridge is the perfect size for the space and for us as a couple. The look and features are top level.",
    "Looks & works great. It’s much smaller than my last one, but fine for 2 people. The bottom freezer bin is kind of a mess though. I will need some kind of organizer.",
    "This refrigerator is tall and slim.  It feels like a real appliance rather than a mini- fridge. It’s perfect for a smaller kitchen though it is a little pricey.",
    "This fridge fits in a little slot but has all the great features of its bigger cousins.  I highly recommend it for a single or couple or as an extra fridge.",
    "This is a small refrigerator but is so roomy! The freezer sections are great for organizing. I especially like the top tray area in the bottom compartment.",
    "This refrigerator has all the features I want and need and then some. I especially like the freezer drawers. They are capacious and close well and fully.",
    "I have just bought a small cabin and I am remodeling. This is the perfect size for a small kitchen.It is very nice looking and has so many fun features.",
    "Bought 2 of these and put side-by-side to mimic a built-in fridge look.  Fits in same space as a 48\" built-in.  Looks great, solid storage, and like the drop-down bottle holders.  Efficient storage options.",
    "Very happy with this refrigerator. Great design, ample room for all of my food items, bright interior lighting, adjustable racks, plenty of freezer space, energy star and great for small spaces.\r\nLove it!",
    "Absolutely love this frig..we had it installed in our motorhome, because we were looking for a specific size!!  So pleased with this refrigerator but disappointed that it does not have an on/off switch!",
    "We bought this fridge to replace an older freezer on top fridge we had. It is surprisingly roomy inside given its smaller size. Especially love the drawer freezers that maximize the storage space",
    null,
    "Absolutely love this refrigerator.  We purchased to put in our wet bar, perfect size and looks super nice.  Also ordered the ice maker and it works better than the one I have in my kitchen.",
    "I have more room to get around in my tiny kitchen.\r\nThe easy access to all I need is wonderful - I am\r\nmore thoughtful of what I purchase, and find I use\r\nwhat I buy and have less waste!",
    "When we remodeled our kitchen, we needed to reclaim some space claimed by a monster side-by-side refrigerator. after much searching we came upon this model. It is perfect for our needs.",
    "I just LOVE, LOVE my new GE bottom freezer refrigerator.  It is absolutely gorgeous!!\r\nAs I am tall, the bottom freezer fits my needs perfectly - and there are 2 freezers.\r\nWhat fun!!",
    "Combines all the features of a large fridge into a  11.0 cu ft unit.   Great or keeping in house as extra fridge and not having to store ity in a garage.  Good value and plus features",
    "I love this refrigerator. GE has come up with a refrigerator that has the style of the larger size ones in a compact size. This is great for people that have small kitchens or live in apartments. I also added the ice maker and it is great.",
    "I love this refrigerator, the looks, the style and all the features. Hope to have for years to come. This small refrigerator looks great in my small kitchen. So glad I did lots of research on slim refrigerators and decided on a GE!!",
    "I love the two freezer drawers . I use one just for ice, much better than a cooler or ice chest. We use the full size small refrigerator on our lanai in Florida - much better than crawling down low for AN UNDER THE COUNTER FRIDGE.",
    "We needed a compact refrigerator for our condo and this fit the bill! Yes, the cubic footage is less but the design and interior layout is so smart we haven't had problems adjusting to it. The two freezer drawers are substantial.",
    "We bought our new GE refrigerator to fit a specific area, it's residing in our mud room just off the kitchen as a supplement to our other GE refrigerator, the reason we went GE again.  Looks great and is perfect for our needs.",
    "Bought based on a recommendation from my sister who had seen the unit in a vacation resort unit. After reading reviews online the only negative comments were regarding features not part of the design for example, no ice maker.",
    "I was pleased to see how much space there was in this refrigerator.  I read another review and he said it was too small for a gallon of milk...well, I can fit 2 gallons, maybe 3 but I didn't try.  I love how quiet it is.",
    "Freezer drawers hold a lot that is easy to access. Top fridge surprisingly holds a lot because of the door storage. The temp gauge keeps all foods at right temp. No guessing the temp is on the digital read out on door.",
    "Perfect size unit plenty of room in refrigerator and with two freezer pull out bins.  Plus is the built in wine rack and the shelf divider which you seem to only get in larger units.  Very happy with the selection",
    "Delivered, set up, plugged in and nothing!  No refrigeration or freezing.  Hard to imagine a manufacturer allowing this to happen. Very poor quality control on GE's part. Would give zero stars if available.",
    "We love this new refrigerator.  It's so compact, and I love the 2 full sized drawers within the top half.  Perfect for fruits/veggies and meats/cheeses.  The two freezer drawers are very easy to slide and the bottom one is quite deep.  It can fit frozen pizzas standing up.",
    "This works fine but we have three people at home and it is a good thing we have a wine fridge we use for fruits and veggies and a full box freezer in the basement.  Would be perfect in a tiny home but I bought a 2K sf 1860 and will likely replace it sooner than later.",
    "When I purchased this refrigerator I thought the size would limit the features but I was wrong everything this refrigerator has is just like a regular size I was overwhelmed  by the LED lighting in the draws and also the refrigerator and all the room through out.",
    "This is a perfect refrigerator for a small space. It’s divided up so cleverly that you can fit in many items and still find them later. The sliding ice tray in the bottom freezer drawer was the icing on the cake. We’re really happy we decided to get this one.",
    "We purchased this refrigerator for a butler pantry and as a backup refrigerator. It is stainless steel and the perfect size, large enough to store our leftovers and meal preparation items. Having the two freezer boxes at the bottom is just an added bonus.",
    "We needed to buy a second refrigerator/freezer and our house is very small. This one is narrow, but uses every cubic inch as we were expecting. The freezer drawers are very easy to access. The refrigerator portion is sized nicely and also customizable.",
    "just purchased so can't really speak of the performance but it has a really nice style for a smaller fridge, the ice maker attachment was a great addition and is working great.  This has gone into a smaller apt that was just updated and love the style.",
    "I don’t have a large kitchen,and this refrigerator fit the bill perfectly!  I like the way it is organized and has lots of configurations possible to accommodate my food storage needs. My one wish is that the bottom pullout had a light as well.",
    "So far so good.  It was only installed today, but it is a very smart looking stainless steel refrigerator.  We are using as a 2nd fridge--mainly for storing beverages (appreciate the wine rack) and overflow freezer space, which we always need.",
    "The design and look of this refrigerator gives my new kitchen an upscale look!  The interior design makes the small space very efficient.   The freezer remarkably holds alot.  I am soooooo happy with this purchase, ideal for small kitchens.",
    "Size is just right for a remodeled small galley kitchen. If you are organizes you can fit quite a bit of frozen food in the 2 freezer compartments. Love the slide out freezer tray that I use for ice cubes. Easy to clean inside and out. I have 1 negative; you can see some slight rippling on the of the fridge; very small but I notice.",
    "Bought a great new home, but kitchen is small, so we bought two of your 2’ wide fridges and put them back to back just outside the kitchen wall. One opens to the kitchen side and the other opens toward the open space living/ dining room. Quite convenient for grabbing refreshments, while leaving more counter space in the kitchen.",
    "*I DIDN'T GIVE IT 5 STARS BECAUSE I JUST STARTING USING IT AND DON'T KNOW HOW WELL IT WILL WORK AND LAST OVER TIME.\r\nThis frig is beautiful inside and out!  I love that the freezer has two separate doors that pull out and so easy to use.  For the dimensions of it there is so much space!!!!  VERY HIGH END LOOKING!",
    "I LOVE IT!!  Never thought I would say that about a frig......Hope it lasts a long time because it is perfect for us (2 people)......Amazing how it seems to always hold whatever we need it to....The freezer drawers are  so easy to use.....it is quiet.....very attractive.....I don't have any cons.......L. Ball",
    "This refrigerator/freezer is a wonderful addition to our home. We have an upright freezer in our utility room and needed some additional freezer and refrigerator space. This 24\" wide model worked perfectly in the space we had. It is well designed with 2 freezer drawers and a nice sized refrigerated section.",
    "So far, I just love this refrigerator. The design is beautiful. The size is so compact, yet has lots of very convenient and smartly designed shelves and compartments. I can't stop admiring it. My hope now is that is does not have any mechanical problems, like so many new appliances do, in the near future.",
    "This refrigerator looks great in our very small kitchen and features many options we like. Only glitch is that we had the ice-maker installed and when the ice bin is full and drawer is opened, ice cubes fall into the bottom drawer! We now switch the ice-maker on and off - seems like a design flaw.",
    "I have a small space for appliances, this one fits to a T.  I can see everything and reach every thing without bending or struggling with a half open door.  Every inch of space is fully accessible to me.  With the freezer drawers below I also can see it all and there is plenty of room.",
    "We purchased this as a second fridge for our mudroom and had limited space width-wise to work with.  This fridge offered the most cubic feet of storage for a 24-inch wide, plus other features we were looking for (bottom freezer, wine rack).  Very happy with its performance so far.",
    "Plenty of space for a refrigerator half the size of a standard one.  Many nice features, LED lighting, adjustable shelves, bottom freezer, reversible door swing, even a bottle rack!  The finish is very nice. Exterior touch screen controls to view/adjust zone temps. Great product!",
    "our kitchen is small in width but long in length and this fridge fits snuggly in the corner without taking up so much width space! the bottom freezer is amazing with a lot of space to store meats or frozen food. one thing i could have done without is the wine bottle rack under one of the top shelves, but its not bothersome since it can be easily folded away. but otherwise, its great!",
    "This was bought to replace one twice as big. The shelving makes it hold a lot\r\nOf food, and the digital settings are very accurate. We are completely off grid solar, and this model should be marketed to all solar homes. At 1.6 amps it draws less than half the current of most refrigerators..And whisper quiet as well.\r\nI would suggest GE put an led light in the bottom freezer as well.",
    "so ive had this fridge for a year today and within the past 2 weeks problems- it goes into sabbath mode by itself had to call for service to come out and this morning 3/1/20 its defrosting on its on. took hours for us to figure out what to do food spoiled over night. i purchased for my tiny kitchen. i'm wondering what the next issue will be. too expensive fridge to act an fool!!!",
    "Really like the ability to lower the temperature in the Fridge . . .  we use the Fridge as a beverage cooler to free-up space in our main kitchen refrigerator.  (Nice not to bend over to access beverages in an under cabinet fridge.)  The bottom freezer drawers are welcome additions, because we needed more freezer space as we make less trips to the market, during the pandemic.",
    "Overall I really like the refrigerator.  Due to it's size there are a few things not available as are in larger refrigerators.  The door shelf can't accomodate a large bottle such as a gallon of milk.  There is no butter keeper.  Storage for taller things is limited.  But as I say, the size which is what I really like in my kitchen, but for that I gave up some features.",
    "This is the first bottom freezer fridge I have ever owned. It is absolutely stunning and so much bigger than I expected. The specs were on point and I was able to install cabinets and countertops before it arrived with no hassle on installation day. I look forward to using my new appliance along side the other GE appliances purchased for the remodel.",
    "This is like having a Star Trek refridgertor! Had difficulty finding something to fit in the small condo kitchen. Saw this and boy does it work! All the features are great. Just can't figure out if the lower freezer drawer has a light and where it's located- it's dark so I'm thinking the bulb is out. Will keep googling but we love this fridge!",
    "If you are considering this refrigerator you probably don't have the average kitchen layout! When designing my studio kitchen it felt like the whole room was taken over by the appliances, crowded and not enough room to work. This refrigerator gave me the idea to  redesign my kitchen with smaller appliances without giving up functionality!",
    "We were looking for a small fridge to fit our small kitchen but every fridge we saw was too small and not enough storage space. This fridge caught our eyes it was perfect slim enough to fit through our small doors but still big and with a good amount of storage for our food. It’s very sleek looking and quiet. Very happy with our purchase.",
    "I love my new fridge!\r\nIt looks great and works really well. The most important thing about this fridge is, that the produce does not get spoiled. Even herbs, fruits and vegetables stay fresh for a really prolonged time.\r\nThis fridge looks slim, but can really hold lots of stuff and will easily accommodate groceries two or more people.",
    "I love the refigerator!  I am concerned about the fan noise.  I have it as a second refrig and it is in the untility room, so I can live with the noise.",
    "I'd been looking for a space saving refrigerator and when I saw this beauty, I knew a closer look was needed. I researched the model, specifically the refrigerator footprint, with the idea of gaining more real estate my small kitchen. I could go on and on but basically I've never been more pleased with a purchase. It's sleek, it's modern, has well organized shelving, fantastic lighting and accurate temperature control. My last fridge was a monster... this one is a stunner..",
    "I am an older person and was looking for a refrigerator that made it easier for me physically. This one has the features I needed with a top fridge and bottom freezer. It also holds more than I thought it would. We were downsizing to make a wider aisle for handicapped accessibility and I worried it would be too small. The bonus is that it looks great! Can’t wait to see how much the electric bill goes down. The fridge has made it through the holidays with flying colors.",
    "I recently seriously downsized and needed a refridgerator/freezer. This appliance had really good reviews so I decided to order it. I have been very pleased with it so far. It is very quiet and holds the temperatures steady. I mainly picked this appliance because of the double pull out freezer doors. Having two freezer sections gives you more flexibility in organizing your frozen food. This appliance is very nice looking also! I highly recommend this model!",
    "Having moved and downsized dramatically I wanted a refrigerator that met my cooling/freezing needs but also looked great in my new smaller space.\r\nThis unit satisfies on both accounts. I love the two freezer compartments, where I can see all the contents immediately and the eye level refrigerator shelves hold a surprizing amount with ease. The simple elegant design sets the tone for my new kitchen. I am very happy with this purchase!",
    "I needed a very narrow refrigerator  to fit in a small space this refrigerator , has it all. not only is it stylish, but very efficient. the double freezer draws and divider makes it easy to  separate your frozen meats and  frozen vegetables. there is plenty of refrigerator space , Great for narrow spaces or as a second refrigerator in your basement or for a small apartment, but tall enough to hold lots of fresh and frozen food.",
    "I own all GE appliances in two homes and some rentals.  This experience is going to make me reconsider my devotion.  After 7 months of service it failed, my tenant lost all her food and I had to buy another fridge to tide he over until it gets fixed.  This is my second(more tame) review as GE moderates reviews to make sure you aren't too mean to them.  Hopefully this gets through and is helpful.",
    "We’ve had this fridge for a couple weeks now. It’s sleep and fits a good amount of food. We have an standard size fridge in the basement and wanted a smaller, sleeker one for our small kitchen. We thought it might have been nicer if one of the drawers was extra fridge space instead of a freezer, but when we added the ice maker we saw it takes up so much room that you really do need two drawers.",
    "We got ours about a month ago. Being used as a primary fridge. It looks great in our apartment.  The refrigerator section interior  could use a better design I find myself moving lots  of little things to get to what I want. The middle bottom freezer was great for a recent party it worked  as our ice chest. the bottom freezer is great holds a lot of stuff. Performance overall is great so far.",
    "Looks, Great.  My wife and I don't store a lot of food so this should work... but. the refrigerator section is small.  I don't see how you could store a gallon of milk for example, except maybe horizontally? so 1/2 gallon containers it is.  The freezer on the other hand is huge - and I actually may use that someday.  A guide to how they designed it to store stuff would make it easier to use.",
    "To our surprise there is no light in bottom lowest freezer drawer.  Seems roomy enough for 2\r\nPeople",
    "This refrigerator has exactly the features I want and need.  I don’t have a large household and most refrigerators are too large which I consider to be a waste of space and energy.  The upper refrigerator part has a bottle rack and two generous drawers plus a very clever adaptable shelving arrangement AND in door space \r\n\r\nThe two freezer drawers are spacious and keep me organized.  I love the tray for smaller items like butter.  \r\n\r\nThe clean front design is ideal in appearance and is easy to clean.  So happy to have found this refrigerator.  AND it is quiet too",
    "Installed on our boat, replacing an older top freezer GE refrigerator.",
    "I bought the fridge for a smaller appartment kitchen which had a narrow space for it. Looks and works excellent. Holds way more stuff than I thought it would. Upper configurable shelf is great as it allows for storing taller items. Two freezer drawers is fantastic too. \r\nThe only cons I found so far is: the stainless steel is definitely not fingerprint - resistant - you will need a good cleaner and the compressor is moderately loud.\r\n\r\nI highly recommend though for anyone with a smaller kitchen and GE brand items I ve owned over the years have all held up well.",
    "Perfect for a small space . Sleek, efficient  design.",
    "We needed a narrow refrigerator to fit the space in our small home. There were relatively few options. This one met our needs. We have used it for a month and it sppears to be working well. Food in the drawer nearest the freezer does tend to freeze. We placed the refrigerator in the left corner of our kitchen. The door then had to mounted with the hinges on the right side, or the drawers would not open fully. We did not attach the water dispenser (did not want one) nor did we purchase the ice maker. We would have preferred a finish other than stainless.",
    "We bought this fridge for a micro-apartment and it is perfect and luxurious. Fits wonderfully into the space without any sacrifices. Love the dual-drawer bottom freezer, and the fact that the drawers are soft-close! In the fridge, the sliding interior shelf and pull-down wine storage are thoughtful features for maximizing interior space. The refrigerator door can be easily switched to open on either side. Gorgeous stainless finish and runs fairly quiet. Overall an extremely functional product, well worth the price, and exactly what we were looking for.",
    "This refrigerator is designed for convenience.  It's somewhat smaller than the one I replaced but I was able to fit everything from the previously full one!  The freezer drawers are a dream to use, and ice cube trays fit easily on the top sliding shelf of the lower freezer.  The separate temp controlled drawer is great for cheeses, drink cans, etc.  the drawer above that is plenty roomy for fruits and vegetables.  the only adjustment I've made is to buy milk in 1/2 gallon containers because gallon ones don't fit on the door.",
    "I purchased this refrigerator as a second fridge. It was going in a bedroom, so it was important that it be virtually silent. I’ve had it now for about three months, and so far, I am extremely pleased. It was just the right size for my needs, and I can’t hear it at all. The refrigerator items are cold, and the freezer items stay frozen.",
    "FOR A SMALL REFRIGERATOR/FREEZER, IT PACKS LOADS OF STORAGE!  LIGHT IN FREEZER IS A PLUS.  DRAWS OPEN EASILY WITH ROOM ENOUGH FOR A STOCK POT IN THE BOTTOM DRAWER.  THE REFER IS AMAZING. IT'S BEAUTIFUL AND QUIET TOO.  EVERYONE WAS AMAZED AT HOW MUCH FOOD IT STORED. IT'S AMAZING...",
    "Lovely fridge for a tight spot! Like the counter depth. It is a good bit smaller and will take some getting used to. Am inspired to be more careful grocery shopping!",
    "I recently bought a small condo that was in need of some TLC. I did a complete remodeling, indluding the kitchen, which is a mear 8' by 10'.  Being single I decided to go with all slim fit appliances.  After much research I felt that this refrigerator best meet my needs.  For it's size, the design has utilized every inch.  I love the double drawer freezer, with so much capacity I had the ice-maker installed and there is still enough room I can get 8 pints of icream in the upper drawer.  Also, the look is very stylish and sleek and my friends have been very impressed with the look and how functional it is for it's size.",
    "It is exceptionally quiet!  As the only 24\" fridge with freezer drawers, I just wish it had more fridge room.  With the extra freezer space, and the built in wine racks, it seems the designer was looking to the second fridge in the garage party crowd, not an NYC apt or where it ended up, at my small Catskill cabin.  So, better if it were taller as only one full shelf can hold anything moderately tall. It would be nice to have at least a full two shelves like that rather than 1 and a half.  Also, yes...totally not fingerprint proof, and a bit shinny.  But it is an awesome machine.  Thank you parent company Haier.",
    "This counter-depth, tall but skinny frig was the perfect fit in an existing space for an empty nester. I love the no visible handle to open the refrigerator where you can see everything at once. The two pull-out freezer drawers are perfect for dividing the more and less used items. And since it was less wide than the existing space, I was able to add a bookshelf for all of my cookbooks.",
    "I needed a specific size 24\"x24\" and this was an exact fit.  Since the freezer isn't used quite as much as the refrigerator, having it on the bottom was a must.  The exterior and exterior design is simple and elegant. The amount of space is deceiving, given the size.  Even the two    freezer-drawers can store an enormous amount of items.",
    "This refrigerator far surpassed my expectations. We have a small space but the added height of this unit and clever layout makes it hold more than I imagined. Love the 2 drawers for freezer. Ice cubes and ice cream in top drawer! Easy to use controls and no bending down to reach dials and guessing which way is colder! Highly recommend!",
    "I have a galley size kitchen and looked high and low for a refrigerator that would fit in a 24-in space. Luckily, I found this . I'm head over heels by the space available, the interchangeability of racks, and the number of spaces for everything from wine bottles to deli meats.",
    "Works great, but about 8 inches shorter than my now defunct Liebherr. Would have preferred more refrigerator space than a storage cubby for my colander (see attached pic).  GE, why not make this model taller?",
    "We got this fridge to replace an existing one when we got our tiny house. Emphasis on \"tiny\". With less than 600 sq ft of living space, everything we moved into this place had to take a footprint seriously. This fridge fit that criteria beautifully, being that more commonplace refrigerators you can readily buy are full size. The features on this mirror for the most part what a normal size fridge can do, only the compartmentalization makes more sense it seems. It's efficient, customizable within reason, and just looks slick. We've had zero issues with our since installing.",
    "I have a small place and do Jenny Craig, so needed a compact fridge with large freezer capacity. This unit is perfect for me!",
    "We are a family of 3 (2 adults, 1 teen) and have a small home built in the late 1800’s, as with a lot of homes that age, the kitchen was built for pure function - so it came with a challenging layout when modern laundry and a half bath were added. We are just at the start of a kitchen refresh, and really needed a few inches to be able to access our laundry closet much easier. This fridge provided the small footprint we needed, and yet has so much more room than we first thought. The interior design is intelligently laid out and maximizes it smaller space. We don’t buy gallon milk, so couldn’t say if one would fit, but the carton milk fits perfect in the door, along with lots of condiments. Plenty of room in the crispier drawer and can fit a 12 pack of cans as well. I like how the wine rack can fold away and how one of the shelves slides back to allow room for taller items!  The freezer is super roomy and easy to access, much, much more room than our larger fridge had! I also appreciate how the freezer is laid out to easily see and access your frozen stuff. Our photos show a barely stocked fridge as we just returned from a week+ long trip, but hopefully it gives you an idea of the roominess",
    "Great product highly recommended!! Had if it for a few week now no complaints so far",
    "Once we received the refrigerator we became delighted with it. It took about 2 months to arrive. Our order had been canceled and our son found this refrigerator on line and it had to be shipped from East Coast to Denver. When the refrigerator was installed and left here it never cooled. A technician was sent only to discover he was in New Jersey. The zip code listed was 00816 and our zip code is 80016. So a local technician finally came and told us the compressor was shot. So back to troubleshooting and GE granted us a new one. Waited another week and FINALLY had a working refrigerator which had been paid for in April 2019. The waiting became quite frustrating but we are very satisfied with it!",
    "Great value for a sleek looking, modern fridge/freezer. I moved into a home that had a custom built-in fridge/freezer and had spent months trying to find a replacement to fit the (abnormally) slim prebuilt slot. None in inventory anywhere so finally found a great deal on this one online at Lowe’s for $1,027. Found the exact same fridge “on sale” at Home Depot for $1,309. No brainer here, especially with free delivery",
    "My kitchen is very small and not only does it fit beautifully, it holds almost as much food as my last 30” refrigerator.  Great ice maker, 2 freezer areas",
    "We love our newest addition to our kitchen! We would recommend to everyone with size limitations in there kitchen.",
    "I bought this nice and cute refrigerator for my new studio. It is spacious and I was very happy with the buy. I don't use the studio at all and check it once in awhile. After a couple of month I found the pooling of water under the fridge and the bottom of kitchen cabinet got damaged because of the water pool was there for many days. Now I'm checking it every other week and it has ice in the bottom and I need to break it up and remove it before the water overflow to my floor.",
    "Reasons why I love this refrigerator:\n\n1.\tSize: This refrigerator fits nicely in our very tiny kitchen (kitchen = basically an L-shaped narrow hallway), and it has enough room inside for two people. We still have yet to pack it full with our typical week's worth of food.\n2.\tLayout: We can see all our perishables at eye level and through glass and clear plastic for less waste of food and any chance of over-purchasing the same items. And the two freezer sections on the bottom make total sense to us — we can see everything at a glance.\n3.\tOutward Appearance: I love the stainless-steel front with contrasting darker metal on the sides for a sleek and modern look that’s not too modern for this house that was built in 1850. I really like the embedded door handles, so nothing is sticking out, so there is more room to walk in the kitchen and less bumping or getting caught on anything.\n4.\tInside the Fridge: I like the fold-back shelf at the top for taller bottles, the moveable wine rack is a lovely, and I like the two drawers in the top part of the fridge for separating foods because if something spills, clean-up should be easier with all mess in one location.\n5.\tDoor Shelves and Lighting: The door shelves are clear, so you can see everything. The lighting is absolutely fabulous in the fridge and the top freezer drawer! \n6.\tInside the Freezer: I like the way it’s set up with dividers that move and a shelf you can slide back, lots of good spots for everything from pizza to frozen veggies.\n7.\tQuiet: This is the most-quiet piece of equipment in the entire house. We barely realize it’s on.\n\nI spent a ton of time mulling over this purchase, reading comments, talking with older relatives, and thinking about going with a less-expensive refrigerator to save money—one that didn't have all the finer details—but I divided the price by the number of years I expect to have this refrigerator, and I decided to get this one. And one of my relatives said: Go with the one you really want and make yourself happy. I'm glad I chose this one—I am happy!",
    "I am almost 6 ft tall and absolutely love that this refrigerator is tall and slim and fits with the design I have created for my tiny home.  We are just getting started on installing the wall cabinets, but we need to make some adjustments before we can permanently install. But we can store food and cold drinks while we work and use our grill to cook.  Love the wine rack as well.",
    "its a great refrigerator, love the adjustable shelf, wine bottle holder, n 2 freezer . it's  a very beautiful refrigerator.",
    "love the look and simplicity of this refrigerator!",
    null,
    "Great for beverages and extra freezer storage-or for small kitchen",
    "Awesome refrigerator with great space and live the two freezers",
    "This fridge is great! Looks nice and works as intended! A++++",
    "Love the size and look perfect for patio home garage overflow",
    "So easy to see all of your food which means less food waste!",
    "Lots of room and convenient layout. Great value for price.",
    "Perfect,it was what I was looking for. I recommend it",
    "So far a great product, just perfect for our kitchen.",
    "I love the design with the 2 drawers in the freezer.",
    "Love the look and holds a lot of food for 2 people.",
    "The refrigerator was a perfect addition to our laundry room area additional storage",
    "Super quiet and keeps everything cold, lots of room for a small size refrigerator.",
    "WOULD HIGHLY RECOMMEND THIS G.E. FRIGERATOR FOR QUALITY, PRICE AND APPEARANCE.",
    "This refrigerator is thoughtfully designed and executed to perform discreetly.",
    "Great size and quality built. This refrigerator is a perfect size for a condo.",
    "We really love our product so far! The perfect size for a small space!!",
    "Love the sleek European design as well as functionality of this model.",
    "Very very cute.\r\nAnd powerful.\r\nI like it. Very enough size freezer.",
    "Perfect size for Pantry refrigerator. Got it just in to for company.",
    "Good looking and sensible design. Very quiet compressor operation.",
    "I was looking for a small but tall refrigerator for about 10 months. When I see its a loved.\r\nFinally I have it.",
    "I have a studio apartment and have lived out of a dorm size fridge forever. So grateful for this fridge.",
    "This refrigerator is larger on the inside than it is on the outside. It's amazing what I can fit inside.",
    "Very happy with purchase, have been using it for the past 30 days, very sleek, functional and quite.",
    "Works great, looks great and has plenty of room for two people!  Great purchase for our small home.",
    "I JUST RECEIVED TODAY.IT'S BEAUTIFUL AND VERY QUIET.I USE IT IN MY OFFICE KITCHEN.VERY IMPRESSIVE",
    "Beautiful refrigerator.  Temperature not even throughout the refrigerator-extra cold spots.",
    "So many classy features and appearance that compliments my \"Petite\" kitchen! Perfection....",
    "I’m very pleased with my buy. It fit and work well with the other items in my kitchen.",
    "feels like a solid appliance and the freezer space is really easy to organize neatly.",
    "I needed a counter depth for a small condo kitchen.  This is sleek looking and the bottom drawers incl. ice maker work perfectly.",
    "We needed a fridge for a compact kitchen. It had to have an icemaker. This fridge exceeds our expectations. So well designed.",
    "I live in a little DC condo, so maximizing space is key. This fridge is sleek and holds most everything I need - even wine!",
    "This refrigerator is perfect. It has tremendous capacity but looks very sleek and streamlined. I was pleasantly surprised.",
    "It's smaller than our old fridge, but we love having the two freezer doors on the bottom and the wine rack in the fridge.",
    "This product is beautiful, user-friendly, fits perfectly in my cozy kitchen. The freezer drawers are amazing. Love it!",
    "There is more room than one would think in the upper refrigerator. \r\nThe separate two freezer drawers are very handy.",
    "I am very happy with this fridge.\r\nMy apartment is small and it fits exactly where I wanted and gives me more space.",
    "It looks great  - very sleek - and the two pull out freezer drawers have a lot of room and are very easy to get to.",
    "Just got it today and it is a beauty! Don’t know how it runs so will have to come back at a later time and up date."
]